# 데이터프레임 중복데이터 다루기

In [1]:
import pandas as pd

df = pd.DataFrame({'c1':['a','a','b','a','b'],
                  'c2':[1,1,1,2,2],
                  'c3':[1,1,2,2,2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

## 중복된 데이터 찾기

### 전체행에서의 중복을 찾기

In [2]:
df_dup = df.duplicated()
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

### 특정열에서의 중복 행값을 찾기

In [3]:
col_dup=df['c2'].duplicated()
col_dup

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

## 중복되는 행 삭제하기

In [4]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [5]:
df2=df.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [7]:
df3=df.drop_duplicates(subset=['c2'])
df3

  c1  c2  c3
0  a   1   1
3  a   2   2

In [8]:
df4=df.drop_duplicates(subset=['c2','c3'])
df4

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2